Repository: couds/react-bulma-components
Catalog: public/src/locales/*/messages.po
Languages: es

source: Configure the sass plugin to include the path where you put the _variables.sass file, for example
es: Configure el plugin sass para incluir la ruta del archivo _variables.sass, por ejemplo

source: Configure your webpack to handle SASS files. See instructions <0>here</0>
es: Configure webpack para procesar archivos SASS. Vea las instrucciones <0>aqui</>

source: Inside the resolve directive setup your webpack to use modules from the folder where you put the _variables.sass file
es: Coloque en la directiva que resuelve los modulos en la configuracion de webpack la ruta de el archivo _variables.sass

source: Now create/update your jsconfig.json (or tsconfig if you are using typescript)
es: Ahora, cree o actualize su archivo jsconfig.json (o tsconfig si utiliza typescript)

source: Now on your next.config.js configure your sass to include the directory where you put your _variables.sass file and add react-bulma-components to the transpiled modules
es: Ahora en su next.config.js configure su sass para incluir el directorio donde ponga su archivo _variables.sass y añada react-bulma-components a los módulos transpilados

source: Where <0>./src</0> its where you put the <1>_variables.sass</1> file
es: Donde <0>./src</0> es el lugar donde pondrá el archivo <1>_variables.sass</1>

source: You need to enable SASS compilation on your CRA project, to do it just install node-sass
es: Necesita activar la compilación SASS en su proyecto CRA, para hacerlo deberá instalar nodo-sass

source: You need to enable SASS compilation on your Gatsby project, See instructions <0>here</0>
es: Necesitas activar la compilación SASS en tu proyecto Gatsby, Ver las instrucciones <0>aquí</0>

source: You need to enable SASS compilation on your Next.js project, See the instructions <0>here</0>
es: Necesitas activar la compilación SASS en tu proyecto Next.js, Ver las instrucciones <0>aquí</0>

source: You will also need to configure the transpiled modules plugin next-plugin-transpile-modules so install it
es: También necesitará configurar el plugin de módulos transpilados next-plugin-transpile-modules, por lo que debe instalarlo

source: advanced instalation
es: instalación avanzada

source: advanced instalation description
es: descripción avanzada de la instalación

source: advanced instalation subtitle
es: subtítulo de instalación avanzada

source: advanced intalation
es: intalación avanzada

source: basic instalation
es: instalación básica

source: basic instalation description
es: descripción básica de la instalación

source: basic instalation subtitle
es: subtítulos de instalación básica

source: create a _variables sass file
es: crear un archivo sass _variables

source: documentation
es: documentacion

source: easy to use
es: fácil de usar

source: easy to use description
es: descripción fácil de usar

source: free
es: gratis

source: free description
es: descripción libre

source: getting started
es: Primeros pasos

source: home
es: Inicio

source: light weight
es: ligero

source: usage
es: uso

source: usage description
es: descripción de uso
